Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcu_stm32f4x.c
  NVIC_SetPriority(OTG_FS_IRQn, NVIC_USB_IRQ_Pri);
  NVIC_ClearPendingIRQ(OTG_FS_IRQn);
  NVIC_EnableIRQ(OTG_FS_IRQn);

  USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_NOVBUSSENS;
  USB_OTG_FS->GCCFG &= ~USB_OTG_GCCFG_VBUSBSEN;
  USB_OTG_FS->GCCFG &= ~USB_OTG_GCCFG_VBUSASEN;

  tusb_cdc_init();
#endif
}

void mcu_uart_init(void) {
#ifdef MCU_HAS_UART
  /*enables RCC clocks and GPIO*/
  RCC->COM_APB |= (COM_APBEN);
  mcu_config_af(TX, GPIO_AF_USART);
  mcu_config_af(RX, GPIO_AF_USART);
  /*setup UART*/
  COM_UART->CR1 = 0; // 8 bits No parity M=0 PCE=0
  COM_UART->CR2 = 0; // 1 stop bit STOP=00
  COM_UART->CR3 = 0;
  COM_UART->SR = 0;
  // //115200 baudrate
  float baudrate = ((float)(UART_CLOCK >> 4) / ((float)(BAUDRATE)));
  uint16_t brr = (uint16_t)baudrate;
  baudrate -= brr;
  brr <<= 4;
  brr += (uint16_t)roundf(16.0f * baudrate);
  COM_UART->BRR = brr;
  COM_UART->CR1 |= USART_CR1_RXNEIE; // enable RXNEIE
  NVIC_SetPriority(COM_IRQ, NVIC_UART_IRQ_Pri);
  NVIC_ClearPendingIRQ(COM_IRQ);
  NVIC_EnableIRQ(COM_IRQ);
  COM_UART->CR1 |=
      (USART_CR1_RE | USART_CR1_TE | USART_CR1_UE); // enable TE, RE and UART
#endif
}

void mcu_uart2_init(void) {
#ifdef MCU_HAS_UART2
  /*enables RCC clocks and GPIO*/
  RCC->COM2_APB |= (COM2_APBEN);
  mcu_config_af(TX2, GPIO_AF_USART2);
  mcu_config_af(RX2, GPIO_AF_USART2);
  /*setup UART*/
  COM2_UART->CR1 = 0; // 8 bits No parity M=0 PCE=0
  COM2_UART->CR2 = 0; // 1 stop bit STOP=00
  COM2_UART->CR3 = 0;
  COM2_UART->SR = 0;
  // //115200 baudrate
  float baudrate2 = ((float)(UART2_CLOCK >> 4) / ((float)(BAUDRATE2)));
  uint16_t brr2 = (uint16_t)baudrate2;
  baudrate2 -= brr2;
  brr2 <<= 4;
  brr2 += (uint16_t)roundf(16.0f * baudrate2);
  COM2_UART->BRR = brr2;
  COM2_UART->CR1 |= USART_CR1_RXNEIE; // enable RXNEIE
  NVIC_SetPriority(COM2_IRQ, NVIC_UART_IRQ_Pri);
  NVIC_ClearPendingIRQ(COM2_IRQ);
  NVIC_EnableIRQ(COM2_IRQ);
  COM2_UART->CR1 |=
      (USART_CR1_RE | USART_CR1_TE | USART_CR1_UE); // enable TE, RE and UART
#endif
}

#ifdef MCU_HAS_USB
DECL_BUFFER(uint8_t, usb_rx, RX_BUFFER_SIZE);

uint8_t mcu_usb_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(usb_rx, &c);
  return c;
}

uint8_t mcu_usb_available(void) { return BUFFER_READ_AVAILABLE(usb_rx); }

void mcu_usb_clear(void) { BUFFER_CLEAR(usb_rx); }

void mcu_usb_putc(uint8_t c) {
  if (!tusb_cdc_write_available()) {
    mcu_usb_flush();
  }
  tusb_cdc_write(c);
}

void mcu_usb_flush(void) {
  tusb_cdc_flush();
  while (!tusb_cdc_write_available()) {
    mcu_dotasks(); // tinyusb device task
    if (!tusb_cdc_connected) {
      return;
    }
  }
}
#endif

#ifdef MCU_HAS_UART
uint8_t mcu_uart_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(uart_rx, &c);
  return c;
}

uint8_t mcu_uart_available(void) { return BUFFER_READ_AVAILABLE(uart_rx); }

void mcu_uart_clear(void) { BUFFER_CLEAR(uart_rx); }

void mcu_uart_putc(uint8_t c) {
  while (!BUFFER_TRY_ENQUEUE(uart_tx, &c)) {
    mcu_uart_flush();
  }
}

void mcu_uart_flush(void) {

  if (!(COM_UART->CR1 & USART_CR1_TXEIE)) // not ready start flushing
  {
    COM_UART->CR1 |= (USART_CR1_TXEIE);
#if ASSERT_PIN(ACTIVITY_LED)
    io_toggle_output(ACTIVITY_LED);
#endif
  }
}

#endif

#ifdef MCU_HAS_UART2
uint8_t mcu_uart2_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(uart2_rx, &c);
  return c;
}

uint8_t mcu_uart2_available(void) { return BUFFER_READ_AVAILABLE(uart2_rx); }

void mcu_uart2_clear(void) { BUFFER_CLEAR(uart2_rx); }

void mcu_uart2_putc(uint8_t c) {
  while (!BUFFER_TRY_ENQUEUE(uart2_tx, &c)) {
    mcu_uart2_flush();
  }
}

void mcu_uart2_flush(void) {
  if (!(COM2_UART->CR1 & USART_CR1_TXEIE)) // not ready start flushing
  {
    COM2_UART->CR1 |= (USART_CR1_TXEIE);
#if ASSERT_PIN(ACTIVITY_LED)
    io_toggle_output(ACTIVITY_LED);
#endif
  }
}

#endif

void mcu_spi_init(void) {
#ifdef MCU_HAS_SPI
  SPI_ENREG |= SPI_ENVAL;
  mcu_config_af(SPI_SDI, SPI_SDI_AFIO);
  mcu_config_af(SPI_CLK, SPI_CLK_AFIO);
  mcu_config_af(SPI_SDO, SPI_SDO_AFIO);
  // #if ASSERT_PIN_IO(SPI_CS)
  // 	mcu_config_af(SPI_CS, SPI_CS_AFIO);
  // #endif
  // initialize the SPI configuration register
  SPI_REG->CR1 = SPI_CR1_SSM     // software slave management enabled
                 | SPI_CR1_SSI   // internal slave select
                 | SPI_CR1_MSTR; // SPI master mode
                                 //    | (SPI_SPEED << 3) | SPI_MODE;
  spi_config_t spi_conf = {0};
  spi_conf.mode = SPI_MODE;
  mcu_spi_config(spi_conf, SPI_FREQ);

  RCC->AHB1ENR |= SPI_DMA_EN;

  NVIC_SetPriority(SPI_IRQ, NVIC_SPI_IRQ_Pri);
  NVIC_ClearPendingIRQ(SPI_IRQ);
  NVIC_EnableIRQ(SPI_IRQ);

  SPI_REG->CR1 |= SPI_CR1_SPE;
#endif
}

void mcu_spi2_init(void) {
#ifdef MCU_HAS_SPI2
  SPI2_ENREG |= SPI2_ENVAL;
  mcu_config_af(SPI2_SDI, SPI2_SDI_AFIO);
  mcu_config_af(SPI2_CLK, SPI2_CLK_AFIO);
  mcu_config_af(SPI2_SDO, SPI2_SDO_AFIO);
  // #if ASSERT_PIN_IO(SPI2_CS)
  // 	mcu_config_af(SPI2_CS, SPI2_CS_AFIO);
  // #endif
  // initialize the SPI2 configuration register
  SPI2_REG->CR1 = SPI_CR1_SSM     // software slave management enabled
                  | SPI_CR1_SSI   // internal slave select
                  | SPI_CR1_MSTR; // SPI2 master mode
                                  //    | (SPI2_SPEED << 3) | SPI2_MODE;
  spi_config_t spi2_conf = {0};
  spi2_conf.mode = SPI2_MODE;
  mcu_spi2_config(spi2_conf, SPI2_FREQ);

  RCC->AHB1ENR |= SPI2_DMA_EN;

  NVIC_SetPriority(SPI2_IRQ, NVIC_SPI_IRQ_Pri);
  NVIC_ClearPendingIRQ(SPI2_IRQ);
  NVIC_EnableIRQ(SPI2_IRQ);

  SPI2_REG->CR1 |= SPI_CR1_SPE;
#endif
}

void mcu_i2c_init() {
#ifdef MCU_HAS_I2C
  RCC->APB1ENR |= I2C_APBEN;
  mcu_config_af(I2C_CLK, I2C_AFIO);
  mcu_config_af(I2C_DATA, I2C_AFIO);
  mcu_config_pullup(I2C_CLK);
  mcu_config_pullup(I2C_DATA);
  // set opendrain
  mcu_config_opendrain(I2C_CLK);
  mcu_config_opendrain(I2C_DATA);
  // reset I2C
  I2C_REG->CR1 |= I2C_CR1_SWRST;
  I2C_REG->CR1 &= ~I2C_CR1_SWRST;
  // set max freq
  I2C_REG->CR2 |= I2C_SPEEDRANGE;
  I2C_REG->TRISE = (I2C_SPEEDRANGE + 1);
  I2C_REG->CCR |= (I2C_FREQ <= 100000UL)
                      ? ((I2C_SPEEDRANGE * 5) & 0x0FFF)
                      : (((I2C_SPEEDRANGE * 5 / 6) & 0x0FFF) | I2C_CCR_FS);
  // initialize the I2C configuration register
  I2C_REG->CR1 |= I2C_CR1_PE;
#endif
}

void mcu_init(void) {
  // make sure both APB1 and APB2 are running at the same clock (48MHz)
  mcu_clocks_init();
  mcu_io_init();
  mcu_rtc_init();
#if SERVOS_MASK > 0
  servo_timer_init();
#endif

  mcu_disable_global_isr();
  stm32_flash_current_offset = 0;
  mcu_eeprom_init();
  mcu_enable_global_isr();
}

/*IO functions*/
// IO functions
void mcu_set_servo(uint8_t servo, uint8_t value) {
#if SERVOS_MASK > 0
  mcu_servos[servo - SERVO_PINS_OFFSET] = value;
#endif
}

/**
 * gets the pwm for a servo (50Hz with tON between 1~2ms)
 * can be defined either as a function or a macro call
 * */
uint8_t mcu_get_servo(uint8_t servo) {
#if SERVOS_MASK > 0
  uint8_t offset = servo - SERVO_PINS_OFFSET;

  if ((1U << offset) & SERVOS_MASK) {
    return mcu_servos[offset];
  }
#endif
  return 0;
}

// ISR
// enables all interrupts on the mcu. Must be called to enable all IRS functions
#ifndef mcu_enable_global_isr
#error "mcu_enable_global_isr undefined"
#endif
// disables all ISR functions
#ifndef mcu_disable_global_isr
#error "mcu_disable_global_isr undefined"
#endif

