Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcu_stm32f4x.c
// Timers
// convert step rate to clock cycles
void mcu_freq_to_clocks(float frequency, uint16_t *ticks,
                        uint16_t *prescaller) {
  frequency = CLAMP((float)F_STEP_MIN, frequency, (float)F_STEP_MAX);

  // up and down counter (generates half the step rate at each event)
  uint32_t totalticks = (uint32_t)((float)(TIMER_CLOCK) / frequency);
  *prescaller = 1;
  while (totalticks > 0xFFFF) {
    *prescaller <<= 1;
    totalticks >>= 1;
  }

  (*prescaller) -= 1;
  *ticks = (uint16_t)totalticks;
}

float mcu_clocks_to_freq(uint16_t ticks, uint16_t prescaller) {
  return ((float)TIMER_CLOCK / (float)(((uint32_t)ticks) << (prescaller)));
}

// starts a constant rate pulse at a given frequency.
void mcu_start_itp_isr(uint16_t ticks, uint16_t prescaller) {
  RCC->TIMER_ENREG |= TIMER_APB;
  TIMER_REG->CR1 = 0;
  TIMER_REG->DIER = 0;
  TIMER_REG->PSC = prescaller;
  TIMER_REG->ARR = ticks;
  TIMER_REG->EGR |= 0x01;
  TIMER_REG->SR &= ~0x01;

  NVIC_SetPriority(MCU_ITP_IRQ, NVIC_ITP_IRQ_Pri);
  NVIC_ClearPendingIRQ(MCU_ITP_IRQ);
  NVIC_EnableIRQ(MCU_ITP_IRQ);

  TIMER_REG->DIER |= 1;
  TIMER_REG->CR1 |= 1; // enable timer upcounter no preload
}

// modifies the pulse frequency
void mcu_change_itp_isr(uint16_t ticks, uint16_t prescaller) {
  TIMER_REG->ARR = ticks;
  TIMER_REG->PSC = prescaller;
  TIMER_REG->EGR |= 0x01;
}

// stops the pulse
void mcu_stop_itp_isr(void) {
  TIMER_REG->CR1 &= ~0x1;
  TIMER_REG->DIER &= ~0x1;
  TIMER_REG->SR &= ~0x01;
  NVIC_DisableIRQ(MCU_ITP_IRQ);
}

// Custom delay function
// gets the mcu running time in ms
uint32_t mcu_millis() { return mcu_runtime_ms; }

uint32_t mcu_micros() { return ((mcu_runtime_ms * 1000) + mcu_free_micros()); }

void mcu_rtc_init() {
  SysTick->CTRL = 0;
  SysTick->LOAD = ((F_CPU / 1000) - 1);
  SysTick->VAL = 0;
  NVIC_SetPriority(SysTick_IRQn, NVIC_RTC_IRQ_Pri);
  SysTick->CTRL = 7;                   // Start SysTick (ABH clock)
  NVIC_SetPriority(PendSV_IRQn, 0xFF); // background task
}

void mcu_dotasks() {
#ifdef MCU_HAS_USB
  tusb_cdc_task(); // tinyusb device task

  while (tusb_cdc_available()) {
    uint8_t c = (uint8_t)tusb_cdc_read();
#if !defined(DETACH_USB_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(usb_rx, &c)) {
        BUFFER_CLEAR(usb_rx);
        STREAM_OVF(c);
      }
    }
#else
    mcu_usb_rx_cb(c);
#endif
  }
#endif
}

// gets were the first copy of the eeprom is
static void mcu_eeprom_init(void) {
#ifndef DISABLE_EEPROM_EMULATION
  uint32_t eeprom_offset = 0;
  for (eeprom_offset = 0; eeprom_offset < FLASH_SECTOR_SIZE;
       eeprom_offset += FLASH_EEPROM_SIZE_WORD_ALIGNED) {
    if (*((volatile uint32_t *)(FLASH_EEPROM_START + eeprom_offset)) ==
        0xFFFFFFFF) {
      break;
    }
  }

  // if not found at start then it's not initialized
  if (eeprom_offset) {
    // one step back
    eeprom_offset -= FLASH_EEPROM_SIZE_WORD_ALIGNED;
    stm32_flash_current_offset = eeprom_offset;
  } else {
    stm32_flash_current_offset = 0;
    stm32_flash_modified = EEPROM_CLEAN;
    memset(stm32_eeprom_buffer, 0, FLASH_EEPROM_SIZE_WORD_ALIGNED);
    return;
  }

  uint32_t counter = (uint32_t)FLASH_EEPROM_SIZE_WORD;
  uint32_t *ptr = ((uint32_t *)&stm32_eeprom_buffer[0]);
  volatile uint32_t *eeprom =
      ((volatile uint32_t *)(FLASH_EEPROM_START + eeprom_offset));
  while (counter--) {
    READ_FLASH(ptr, eeprom);
    eeprom++;
    ptr++;
  }
#endif
}

// Non volatile memory
uint8_t mcu_eeprom_getc(uint16_t address) {
  if (NVM_STORAGE_SIZE <= address) {
    DBGMSG("EEPROM invalid address @ %u", address);
    return 0;
  }
  return stm32_eeprom_buffer[address];
}

static void mcu_eeprom_erase(void) {
#ifndef DISABLE_EEPROM_EMULATION
  while (FLASH->SR & FLASH_SR_BSY)
    ; // wait while busy
  // unlock flash if locked
  if (FLASH->CR & FLASH_CR_LOCK) {
    FLASH->KEYR = 0x45670123;
    FLASH->KEYR = 0xCDEF89AB;
  }
  FLASH->CR = 0; // Ensure PG bit is low
  FLASH->CR |= FLASH_CR_SER | (((FLASH_SECTORS - 1) << FLASH_CR_SNB_Pos) &
                               FLASH_CR_MER_Msk); // set the SER bit
  FLASH->CR |= FLASH_CR_STRT;                     // set the start bit
  while (FLASH->SR & FLASH_SR_BSY)
    ; // wait while busy
  FLASH->CR = 0;
#endif
}

void mcu_eeprom_putc(uint16_t address, uint8_t value) {
  if (NVM_STORAGE_SIZE <= address) {
    DBGMSG("EEPROM invalid address @ %u", address);
  }
  // if the value of the eeprom is modified then it will be marked as dirty
  // flash default value is 0xFF. If programming can change value from 1 to 0
  // but not the other way around if a bit is changed from 0 back to 1 then it
  // will need to rewrite values in a new page flash read and writing is done in
  // negated form
  if (stm32_eeprom_buffer[address] != value) {
    stm32_flash_modified |= EEPROM_DIRTY;
    if ((value ^ stm32_eeprom_buffer[address]) & ~value) {
      stm32_flash_modified |= EEPROM_NEEDS_NEWPAGE;
    }
  }

  stm32_eeprom_buffer[address] = value;
}

void mcu_eeprom_flush() {
#ifndef DISABLE_EEPROM_EMULATION
  if (stm32_flash_modified) {
    if (CHECKFLAG(stm32_flash_modified, EEPROM_NEEDS_NEWPAGE)) {
      stm32_flash_current_offset += FLASH_EEPROM_SIZE_WORD_ALIGNED;
    }

    if (stm32_flash_current_offset >= FLASH_EEPROM_END) {
      mcu_eeprom_erase();
      stm32_flash_current_offset = 0;
    }

    volatile uint32_t *eeprom = ((
        volatile uint32_t *)(FLASH_EEPROM_START + stm32_flash_current_offset));
    uint32_t *ptr = ((uint32_t *)&stm32_eeprom_buffer[0]);
    uint32_t counter = (uint32_t)FLASH_EEPROM_SIZE_WORD;
    while (counter--) {
      while (FLASH->SR & FLASH_SR_BSY)
        ; // wait while busy
      mcu_disable_global_isr();
      // unlock flash if locked
      if (FLASH->CR & FLASH_CR_LOCK) {
        FLASH->KEYR = 0x45670123;
        FLASH->KEYR = 0xCDEF89AB;
      }
      FLASH->CR = 0;
      FLASH->CR |= FLASH_CR_PSIZE_1;
      FLASH->CR |= FLASH_CR_PG; // Ensure PG bit is high
      WRITE_FLASH(eeprom, ptr);
      while (FLASH->SR & FLASH_SR_BSY)
        ; // wait while busy
      mcu_enable_global_isr();
      if (FLASH->SR & (FLASH_SR_PGAERR | FLASH_SR_PGPERR | FLASH_SR_PGSERR))
        proto_error(42); // STATUS_SETTING_WRITE_FAIL
      if (FLASH->SR & FLASH_SR_WRPERR)
        proto_error(43); // STATUS_SETTING_PROTECTED_FAIL
      FLASH->CR = 0;     // Ensure PG bit is low
      FLASH->SR = 0;
      eeprom++;
      ptr++;
    }
    stm32_flash_modified = EEPROM_CLEAN;

    // Restore interrupt flag state.*/
  }
#endif
}

typedef enum spi_port_state_enum {
  SPI_UNKNOWN = 0,
  SPI_IDLE = 1,
  SPI_TRANSMITTING = 2,
  SPI_TRANSMIT_COMPLETE = 3,
} spi_port_state_t;

#ifdef MCU_HAS_SPI
static volatile spi_port_state_t spi_port_state = SPI_UNKNOWN;
static bool spi_enable_dma = false;

void mcu_spi_config(spi_config_t config, uint32_t frequency) {
  uint8_t div = (uint8_t)(SPI_CLOCK / frequency);

  uint8_t speed;
  if (div < 2) {
    speed = 0;
  } else if (div < 4) {
    speed = 1;
  } else if (div < 8) {
    speed = 2;
  } else if (div < 16) {
    speed = 3;
  } else if (div < 32) {
    speed = 4;
  } else if (div < 64) {
    speed = 5;
  } else if (div < 128) {
    speed = 6;
  } else {
    speed = 7;
  }

  // disable SPI
  SPI_REG->CR1 &= ~SPI_CR1_SPE;
  // clear speed and mode
  SPI_REG->CR1 &= ~0x3B;
  SPI_REG->CR1 |= (speed << 3) | config.mode;
  // enable SPI
  SPI_REG->CR1 |= SPI_CR1_SPE;

  spi_port_state = SPI_IDLE;
  spi_enable_dma = config.enable_dma;
}

uint8_t mcu_spi_xmit(uint8_t c) {
  SPI_REG->DR = c;
  while (!(SPI_REG->SR & SPI_SR_TXE) || (SPI_REG->SR & SPI_SR_BSY))
    ;
  uint8_t data = SPI_REG->DR;
  spi_port_state = SPI_IDLE;
  return data;
}

static const uint8_t *spi_transfer_tx_ptr = 0;
static uint8_t *spi_transfer_rx_ptr = 0;
static uint16_t spi_transfer_tx_len = 0;
static uint16_t spi_transfer_rx_len = 0;

