Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcu_stm32f4x.c
void SPI_ISR() {
  if ((SPI_REG->SR & SPI_SR_TXE) && spi_transfer_tx_len) {
    SPI_REG->DR = *spi_transfer_tx_ptr++;
    --spi_transfer_tx_len;
  }
  if ((SPI_REG->SR & SPI_SR_RXNE) && spi_transfer_rx_len) {
    *spi_transfer_rx_ptr++ = SPI_REG->DR;
    --spi_transfer_rx_len;
  }
  if (spi_transfer_tx_len == 0 && spi_transfer_rx_len == 0) {
    SPI_REG->CR2 &= ~(SPI_CR2_TXEIE | SPI_CR2_RXNEIE);
    spi_port_state = SPI_TRANSMIT_COMPLETE;
  }
  NVIC_ClearPendingIRQ(SPI_IRQ);
}

/*
 * Performs a bulk SPI transfer
 * Returns:
 *	true - transfer in progress, keep polling
 *	false - transfer complete
 */
bool mcu_spi_bulk_transfer(const uint8_t *tx_data, uint8_t *rx_data,
                           uint16_t datalen) {
  if (!spi_enable_dma) {
    // Bulk transfer without DMA
    if (spi_port_state == SPI_IDLE) {
      spi_port_state = SPI_TRANSMITTING;

      spi_transfer_tx_ptr = tx_data;
      spi_transfer_tx_len = datalen;
      SPI_REG->CR2 |= SPI_CR2_TXEIE;

      if (rx_data) {
        spi_transfer_rx_ptr = rx_data;
        spi_transfer_rx_len = datalen;
        SPI_REG->CR2 |= SPI_CR2_RXNEIE;
      } else {
        spi_transfer_rx_ptr = 0;
        spi_transfer_rx_len = 0;
      }
    } else if (spi_port_state == SPI_TRANSMIT_COMPLETE) {
      spi_port_state = SPI_IDLE;
      return false;
    }

    return true;
  }

  if (spi_port_state == SPI_TRANSMITTING) {
    // Wait for transfers to complete
    if (!(SPI_DMA_TX_ISR >> (SPI_DMA_TX_IFR_POS + 5)) ||
        (!(SPI_DMA_RX_ISR >> (SPI_DMA_RX_IFR_POS + 5)) && rx_data))
      return true;

    // SPI hardware still transmitting the last byte
    if (SPI_REG->SR & SPI_SR_BSY)
      return true;

    // Disable DMA use
    SPI_REG->CR2 &= ~SPI_CR2_TXDMAEN;
    if (rx_data)
      SPI_REG->CR2 &= ~SPI_CR2_RXDMAEN;

    // Transfer finished
    spi_port_state = SPI_IDLE;
    return false;
  }

  if (spi_port_state != SPI_IDLE) {
    // Wait for idle
    if (SPI_REG->SR & SPI_SR_BSY)
      return true;
    spi_port_state = SPI_IDLE;
  }

  // Wait until streams are available
  if ((SPI_DMA_TX_STREAM->CR & DMA_SxCR_EN) ||
      ((SPI_DMA_RX_STREAM->CR & DMA_SxCR_EN) && rx_data))
    return true;

  /***     Setup Transmit DMA     ***/

  // Clear flags
  SPI_DMA_TX_IFCR |= SPI_DMA_TX_IFCR_MASK;

  SPI_DMA_TX_STREAM->CR =
      (SPI_DMA_TX_CHANNEL << DMA_SxCR_CHSEL_Pos) | // Select correct channel
      (0b01 << DMA_SxCR_PL_Pos) |                  // Set priority to medium
      DMA_SxCR_MINC |                              // Increment memory
      (0b01 << DMA_SxCR_DIR_Pos); // Memory to peripheral transfer direction

  SPI_DMA_TX_STREAM->PAR = (uint32_t)&SPI_REG->DR;
  SPI_DMA_TX_STREAM->M0AR = (uint32_t)tx_data;

  SPI_DMA_TX_STREAM->NDTR = datalen;

  SPI_DMA_TX_STREAM->FCR &= ~DMA_SxFCR_DMDIS; // Enable direct mode

  // Enable DMA use for transmission
  SPI_REG->CR2 |= SPI_CR2_TXDMAEN;

  if (rx_data) {
    /***     Setup Receive DMA     ***/

    // Clear flags
    SPI_DMA_RX_IFCR |= SPI_DMA_RX_IFCR_MASK;

    SPI_DMA_RX_STREAM->CR =
        (SPI_DMA_RX_CHANNEL << DMA_SxCR_CHSEL_Pos) | // Select correct channel
        (0b01 << DMA_SxCR_PL_Pos) |                  // Set priority to medium
        DMA_SxCR_MINC |                              // Increment memory
        (0b00 << DMA_SxCR_DIR_Pos); // Peripheral to memory transfer direction

    SPI_DMA_RX_STREAM->PAR = (uint32_t)&SPI_REG->DR;
    SPI_DMA_RX_STREAM->M0AR = (uint32_t)rx_data;

    SPI_DMA_RX_STREAM->NDTR = datalen;

    SPI_DMA_RX_STREAM->FCR &= ~DMA_SxFCR_DMDIS; // Enable direct mode

    // Enable DMA use for reception
    SPI_REG->CR2 |= SPI_CR2_RXDMAEN;
  }

  /***     DMA Setup Complete     ***/

  // Start streams
  SPI_DMA_TX_STREAM->CR |= DMA_SxCR_EN;
  if (rx_data)
    SPI_DMA_RX_STREAM->CR |= DMA_SxCR_EN;

  // Transmission started
  spi_port_state = SPI_TRANSMITTING;
  return true;
}

#endif

#ifdef MCU_HAS_SPI2
static volatile spi_port_state_t spi2_port_state = SPI_UNKNOWN;
static bool spi2_enable_dma = false;

void mcu_spi2_config(spi_config_t config, uint32_t frequency) {
  uint8_t div = (uint8_t)(SPI2_CLOCK / frequency);

  uint8_t speed;
  if (div < 2) {
    speed = 0;
  } else if (div < 4) {
    speed = 1;
  } else if (div < 8) {
    speed = 2;
  } else if (div < 16) {
    speed = 3;
  } else if (div < 32) {
    speed = 4;
  } else if (div < 64) {
    speed = 5;
  } else if (div < 128) {
    speed = 6;
  } else {
    speed = 7;
  }

  // disable SPI2
  SPI2_REG->CR1 &= ~SPI_CR1_SPE;
  // clear speed and mode
  SPI2_REG->CR1 &= ~0x3B;
  SPI2_REG->CR1 |= (speed << 3) | config.mode;
  // enable SPI2
  SPI2_REG->CR1 |= SPI_CR1_SPE;

  spi2_port_state = SPI_IDLE;
  spi2_enable_dma = config.enable_dma;
}

uint8_t mcu_spi2_xmit(uint8_t c) {
  SPI2_REG->DR = c;
  while (!(SPI2_REG->SR & SPI_SR_TXE) || (SPI2_REG->SR & SPI_SR_BSY))
    ;
  uint8_t data = SPI2_REG->DR;
  spi2_port_state = SPI_IDLE;
  return data;
}

static const uint8_t *spi2_transfer_tx_ptr = 0;
static uint8_t *spi2_transfer_rx_ptr = 0;
static uint16_t spi2_transfer_tx_len = 0;
static uint16_t spi2_transfer_rx_len = 0;

void SPI2_ISR() {
  if ((SPI2_REG->SR & SPI_SR_TXE) && spi2_transfer_tx_len) {
    SPI2_REG->DR = *spi2_transfer_tx_ptr++;
    --spi2_transfer_tx_len;
  }
  if ((SPI2_REG->SR & SPI_SR_RXNE) && spi2_transfer_rx_len) {
    *spi2_transfer_rx_ptr++ = SPI2_REG->DR;
    --spi2_transfer_rx_len;
  }
  if (spi2_transfer_tx_len == 0 && spi2_transfer_rx_len == 0) {
    SPI2_REG->CR2 &= ~(SPI_CR2_TXEIE | SPI_CR2_RXNEIE);
    spi2_port_state = SPI_TRANSMIT_COMPLETE;
  }
  NVIC_ClearPendingIRQ(SPI2_IRQ);
}

/*
 * Performs a bulk SPI2 transfer
 * Returns:
 *	true - transfer in progress, keep polling
 *	false - transfer complete
 */
bool mcu_spi2_bulk_transfer(const uint8_t *tx_data, uint8_t *rx_data,
                            uint16_t datalen) {
  if (!spi2_enable_dma) {
    // Bulk transfer without DMA
    if (spi2_port_state == SPI_IDLE) {
      spi2_port_state = SPI_TRANSMITTING;

      spi2_transfer_tx_ptr = tx_data;
      spi2_transfer_tx_len = datalen;
      SPI2_REG->CR2 |= SPI_CR2_TXEIE;

