Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcu_stm32f4x.c
      if (rx_data) {
        spi2_transfer_rx_ptr = rx_data;
        spi2_transfer_rx_len = datalen;
        SPI2_REG->CR2 |= SPI_CR2_RXNEIE;
      } else {
        spi2_transfer_rx_ptr = 0;
        spi2_transfer_rx_len = 0;
      }
    } else if (spi2_port_state == SPI_TRANSMIT_COMPLETE) {
      spi2_port_state = SPI_IDLE;
      return false;
    }

    return true;
  }

  if (spi2_port_state == SPI_TRANSMITTING) {
    // Wait for transfers to complete
    if (!(SPI2_DMA_TX_ISR >> (SPI2_DMA_TX_IFR_POS + 5)) ||
        (!(SPI2_DMA_RX_ISR >> (SPI2_DMA_RX_IFR_POS + 5)) && rx_data))
      return true;

    // SPI2 hardware still transmitting the last byte
    if (SPI2_REG->SR & SPI_SR_BSY)
      return true;

    // Disable DMA use
    SPI2_REG->CR2 &= ~SPI_CR2_TXDMAEN;
    if (rx_data)
      SPI2_REG->CR2 &= ~SPI_CR2_RXDMAEN;

    // Transfer finished
    spi2_port_state = SPI_IDLE;
    return false;
  }

  if (spi2_port_state != SPI_IDLE) {
    // Wait for idle
    if (SPI2_REG->SR & SPI_SR_BSY)
      return true;
    spi2_port_state = SPI_IDLE;
  }

  // Wait until streams are available
  if ((SPI2_DMA_TX_STREAM->CR & DMA_SxCR_EN) ||
      ((SPI2_DMA_RX_STREAM->CR & DMA_SxCR_EN) && rx_data))
    return true;

  /***     Setup Transmit DMA     ***/

  // Clear flags
  SPI2_DMA_TX_IFCR |= SPI2_DMA_TX_IFCR_MASK;

  SPI2_DMA_TX_STREAM->CR =
      (SPI2_DMA_TX_CHANNEL << DMA_SxCR_CHSEL_Pos) | // Select correct channel
      (0b01 << DMA_SxCR_PL_Pos) |                   // Set priority to medium
      DMA_SxCR_MINC |                               // Increment memory
      (0b01 << DMA_SxCR_DIR_Pos); // Memory to peripheral transfer direction

  SPI2_DMA_TX_STREAM->PAR = (uint32_t)&SPI2_REG->DR;
  SPI2_DMA_TX_STREAM->M0AR = (uint32_t)tx_data;

  SPI2_DMA_TX_STREAM->NDTR = datalen;

  SPI2_DMA_TX_STREAM->FCR &= ~DMA_SxFCR_DMDIS; // Enable direct mode

  // Enable DMA use for transmission
  SPI2_REG->CR2 |= SPI_CR2_TXDMAEN;

  if (rx_data) {
    /***     Setup Receive DMA     ***/

    // Clear flags
    SPI2_DMA_RX_IFCR |= SPI2_DMA_RX_IFCR_MASK;

    SPI2_DMA_RX_STREAM->CR =
        (SPI2_DMA_RX_CHANNEL << DMA_SxCR_CHSEL_Pos) | // Select correct channel
        (0b01 << DMA_SxCR_PL_Pos) |                   // Set priority to medium
        DMA_SxCR_MINC |                               // Increment memory
        (0b00 << DMA_SxCR_DIR_Pos); // Peripheral to memory transfer direction

    SPI2_DMA_RX_STREAM->PAR = (uint32_t)&SPI2_REG->DR;
    SPI2_DMA_RX_STREAM->M0AR = (uint32_t)rx_data;

    SPI2_DMA_RX_STREAM->NDTR = datalen;

    SPI2_DMA_RX_STREAM->FCR &= ~DMA_SxFCR_DMDIS; // Enable direct mode

    // Enable DMA use for reception
    SPI2_REG->CR2 |= SPI_CR2_RXDMAEN;
  }

  /***     DMA Setup Complete     ***/

  // Start streams
  SPI2_DMA_TX_STREAM->CR |= DMA_SxCR_EN;
  if (rx_data)
    SPI2_DMA_RX_STREAM->CR |= DMA_SxCR_EN;

  // Transmission started
  spi2_port_state = SPI_TRANSMITTING;
  return true;
}

#endif

#ifdef MCU_HAS_I2C
#if I2C_ADDRESS == 0
void mcu_i2c_write_stop(bool *stop) {
  if (*stop) {
    int32_t ms_timeout = 25;

    I2C_REG->CR1 |= I2C_CR1_STOP;
    __TIMEOUT_MS__(ms_timeout) {
      if (I2C_REG->CR1 & I2C_CR1_STOP) {
        return;
      }
    }
  }
}

static uint8_t mcu_i2c_write(uint8_t data, bool send_start, bool send_stop,
                             uint32_t ms_timeout) {
  bool stop __attribute__((__cleanup__(mcu_i2c_write_stop))) = send_stop;
  int32_t timeout = ms_timeout;

  uint32_t status = send_start ? I2C_SR1_ADDR : I2C_SR1_BTF;
  I2C_REG->SR1 &= ~I2C_SR1_AF;
  if (send_start) {
    if ((I2C_REG->SR1 & I2C_SR1_ARLO) ||
        ((I2C_REG->CR1 & I2C_CR1_START) && (I2C_REG->CR1 & I2C_CR1_STOP))) {
      // Save values
      uint32_t cr2 = I2C_REG->CR2;
      uint32_t ccr = I2C_REG->CCR;
      uint32_t trise = I2C_REG->TRISE;

      // Software reset
      I2C_REG->CR1 |= I2C_CR1_SWRST;
      I2C_REG->CR1 &= ~I2C_CR1_SWRST;

      // Restore values
      I2C_REG->CR2 = cr2;
      I2C_REG->CCR = ccr;
      I2C_REG->TRISE = trise;

      // Enable
      I2C_REG->CR1 |= I2C_CR1_PE;
    }

    // init
    I2C_REG->CR1 |= I2C_CR1_START;

    __TIMEOUT_MS__(timeout) {
      if ((I2C_REG->SR1 & I2C_SR1_SB) && (I2C_REG->SR2 & I2C_SR2_MSL) &&
          (I2C_REG->SR2 & I2C_SR2_BUSY)) {
        break;
      }
      if (I2C_REG->SR1 & I2C_SR1_ARLO) {
        stop = false;
        return I2C_NOTOK;
      }
    }

    __TIMEOUT_ASSERT__(timeout) {
      stop = true;
      return I2C_NOTOK;
    }

    if (I2C_REG->SR1 & I2C_SR1_AF) {
      stop = true;
      return I2C_NOTOK;
    }
  }

  I2C_REG->DR = data;
  timeout = ms_timeout;
  __TIMEOUT_MS__(timeout) {
    if (I2C_REG->SR1 & status) {
      break;
    }
    if (I2C_REG->SR1 & I2C_SR1_AF) {
      break;
    }
    if (I2C_REG->SR1 & I2C_SR1_ARLO) {
      stop = false;
      return I2C_NOTOK;
    }
  }

  __TIMEOUT_ASSERT__(timeout) {
    stop = true;
    return I2C_NOTOK;
  }
  // read SR2 to clear ADDR
  if (send_start) {
    status = I2C_REG->SR2;
  }

  if (I2C_REG->SR1 & I2C_SR1_AF) {
    stop = true;
    return I2C_NOTOK;
  }

  return I2C_OK;
}

static uint8_t mcu_i2c_read(uint8_t *data, bool with_ack, bool send_stop,
                            uint32_t ms_timeout) {
  *data = 0xFF;
  bool stop __attribute__((__cleanup__(mcu_i2c_write_stop))) = send_stop;

  if (!with_ack) {
    I2C_REG->CR1 &= ~I2C_CR1_ACK;
    stop = false;
    mcu_i2c_write_stop(&send_stop);
  } else {
    I2C_REG->CR1 |= I2C_CR1_ACK;
  }

  __TIMEOUT_MS__(ms_timeout) {
    if (I2C_REG->SR1 & I2C_SR1_RXNE) {
      *data = I2C_REG->DR;
      return I2C_OK;
    }
  }

  stop = true;
  return I2C_NOTOK;
}

#ifndef mcu_i2c_send
// master sends command to slave
uint8_t mcu_i2c_send(uint8_t address, uint8_t *data, uint8_t datalen,
                     bool release, uint32_t ms_timeout) {
  if (data && datalen) {
    if (mcu_i2c_write(address << 1, true, false, ms_timeout) ==
        I2C_OK) // start, send address, write
    {
      // send data, stop
      do {
        datalen--;
        bool last = (datalen == 0);
        if (mcu_i2c_write(*data, false, (release & last), ms_timeout) !=
            I2C_OK) {
          return I2C_NOTOK;
        }
        data++;

      } while (datalen);

      return I2C_OK;
    }
  }

  return I2C_NOTOK;
}
#endif

#ifndef mcu_i2c_receive
// master receive response from slave
uint8_t mcu_i2c_receive(uint8_t address, uint8_t *data, uint8_t datalen,
                        uint32_t ms_timeout) {
  if (data && datalen) {
    if (mcu_i2c_write((address << 1) | 0x01, true, false, ms_timeout) ==
        I2C_OK) // start, send address, write
    {
      do {
        datalen--;
        bool last = (datalen == 0);
        if (mcu_i2c_read(data, !last, last, ms_timeout) != I2C_OK) {
          return I2C_NOTOK;
        }
        data++;
      } while (datalen);
      return I2C_OK;
    }
  }

  return I2C_NOTOK;
}
#endif
#endif

#ifndef mcu_i2c_config
void mcu_i2c_config(uint32_t frequency) {
  RCC->APB1ENR |= I2C_APBEN;
  mcu_config_opendrain(I2C_CLK);
  mcu_config_opendrain(I2C_DATA);
  mcu_config_af(I2C_CLK, I2C_AFIO);
  mcu_config_af(I2C_DATA, I2C_AFIO);
#ifdef SPI_REMAP
  AFIO->MAPR |= I2C_REMAP;
#endif
  // reset I2C
  I2C_REG->CR1 |= I2C_CR1_SWRST;
  I2C_REG->CR1 &= ~I2C_CR1_SWRST;
#if I2C_ADDRESS == 0
  // set max freq
  I2C_REG->CR2 |= I2C_SPEEDRANGE;
  I2C_REG->TRISE = (I2C_SPEEDRANGE + 1);
  I2C_REG->CCR |= (frequency <= 100000UL)
                      ? ((I2C_SPEEDRANGE * 5) & 0x0FFF)
                      : (((I2C_SPEEDRANGE * 5 / 6) & 0x0FFF) | I2C_CCR_FS);
#else
  // set address
  I2C_REG->OAR1 &= ~(I2C_OAR1_ADDMODE | 0x0F);
  I2C_REG->OAR1 |= (I2C_ADDRESS << 1);
  I2C_REG->OAR2 = 0;
  I2C_REG->CR1 &= ~I2C_CR1_NOSTRETCH;
  // enable events
  I2C_REG->CR2 |= (I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
  NVIC_SetPriority(I2C_IRQ, NVIC_I2C_IRQ_Pri);
  NVIC_ClearPendingIRQ(I2C_IRQ);
  NVIC_EnableIRQ(I2C_IRQ);
#endif
  // initialize the SPI configuration register
  I2C_REG->CR1 |= (I2C_CR1_PE | I2C_CR1_ENGC);
#if I2C_ADDRESS != 0
  // prepare ACK in slave mode
  I2C_REG->CR1 |= I2C_CR1_ACK;
#endif
}
#endif

