Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcu_stm32f4x.c
#if I2C_ADDRESS != 0
uint8_t mcu_i2c_buffer[I2C_SLAVE_BUFFER_SIZE];

void I2C_ISR(void) {
  static uint8_t index = 0;
  static uint8_t datalen = 0;

  uint8_t i = index;

  // address match or generic call
  // Clear ISR flag by reading SR1 and SR2 registers
  if ((I2C_REG->SR1 & I2C_SR1_ADDR)) {
    // clear the ISR flag
    volatile uint32_t status = I2C_REG->SR1;
    (void)status;
    status = I2C_REG->SR2;
    (void)status;

    // // Address matched, do necessary processing
    if ((status & I2C_SR2_TRA) && !datalen) {
      mcu_i2c_buffer[i] = 0;
      // unlock ISR and process the info request
      // mcu_enable_global_isr();
      mcu_i2c_slave_cb(mcu_i2c_buffer, &i);
      datalen = i;
    }
    i = 0;
  }

  if ((I2C_REG->SR1 & I2C_SR1_RXNE)) {
    mcu_i2c_buffer[i++] = I2C_REG->DR;
  }

  if ((I2C_REG->SR1 & I2C_SR1_TXE)) {
    I2C_REG->DR = mcu_i2c_buffer[i++];
    if (i > datalen) {
      // send NACK
      I2C_REG->CR1 |= I2C_CR1_STOP;
      datalen = 0;
    }
  }

  // Clear ISR flag by reading SR1 and writing CR1 registers
  if ((I2C_REG->SR1 & I2C_SR1_STOPF)) {
    // clear the ISR flag
    volatile uint32_t status = I2C_REG->SR1;
    (void)status;
    I2C_REG->CR1 |= I2C_CR1_PE;
    // stop transmission
    datalen = 0;
  }

  // An error ocurred
  if (I2C_REG->SR1 & 0XFF00) {
    // prepare ACK for next transmission
    index = 0;
    datalen = 0;
    I2C_REG->CR1 |= I2C_CR1_ACK;
    I2C_REG->CR2 |= (I2C_CR2_ITEVTEN | I2C_CR2_ITERREN);
    // clear ISR flag
    I2C_REG->SR1 = I2C_REG->SR1 & 0X00FF;
    volatile uint32_t status = I2C_REG->SR1;
    (void)status;
    status = I2C_REG->SR2;
    (void)status;
  }

  // prepare ACK for next transmition
  index = i;
  I2C_REG->CR1 |= I2C_CR1_ACK;
  NVIC_ClearPendingIRQ(I2C_IRQ);
}
#endif

#endif

#ifdef MCU_HAS_ONESHOT_TIMER

void MCU_ONESHOT_ISR(void) {
  if ((ONESHOT_TIMER_REG->SR & 1)) {
    ONESHOT_TIMER_REG->DIER = 0;
    ONESHOT_TIMER_REG->SR = 0;
    ONESHOT_TIMER_REG->CR1 = 0;

    if (mcu_timeout_cb) {
      mcu_timeout_cb();
    }
  }

  NVIC_ClearPendingIRQ(MCU_ONESHOT_IRQ);
}

/**
 * configures a single shot timeout in us
 * */
#ifndef mcu_config_timeout
void mcu_config_timeout(mcu_timeout_delgate fp, uint32_t timeout) {
  // up and down counter (generates half the step rate at each event)
  uint32_t clocks = (uint32_t)((ONESHOT_TIMER_CLOCK / 1000000UL) * timeout);
  uint32_t presc = 1;

  mcu_timeout_cb = fp;

  while (clocks > 0xFFFF) {
    presc <<= 1;
    clocks >>= 1;
  }

  presc--;
  clocks--;

  RCC->ONESHOT_TIMER_ENREG |= ONESHOT_TIMER_APB;
  ONESHOT_TIMER_REG->CR1 = 0;
  ONESHOT_TIMER_REG->DIER = 0;
  ONESHOT_TIMER_REG->PSC = presc;
  ONESHOT_TIMER_REG->ARR = clocks;
  ONESHOT_TIMER_REG->EGR |= 0x01;
  ONESHOT_TIMER_REG->SR = 0;
  ONESHOT_TIMER_REG->CNT = 0;

  NVIC_SetPriority(MCU_ONESHOT_IRQ, NVIC_ONESHOT_IRQ_Pri);
  NVIC_ClearPendingIRQ(MCU_ONESHOT_IRQ);
  NVIC_EnableIRQ(MCU_ONESHOT_IRQ);

  // ONESHOT_TIMER_REG->DIER |= 1;
  // ONESHOT_TIMER_REG->CR1 |= 1; // enable timer upcounter no preload
}
#endif

/**
 * starts the timeout. Once hit the the respective callback is called
 * */
#ifndef mcu_start_timeout
void mcu_start_timeout() {}
#endif
#endif

#endif
